* This is first project of data analysis that i will be attempting*

In [51]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
%matplotlib inline
import seaborn as sns

In [52]:
# First we just read the csv file that we have downloaded
df = pd.read_csv("first.csv")
df

     customer_id   age         income  gender signup_date
0              1  56.0   15703.823439    Male  2023-01-01
1              2  69.0   67328.537566  Female  2023-01-02
2              3  46.0   56305.706024    Male  2023-01-03
3              4  32.0   50514.889743    Male  2023-01-04
4              5  60.0   56376.411648  Female  2023-01-05
..           ...   ...            ...     ...         ...
145          146  22.0   56228.112091    Male  2023-05-26
146          147  43.0   89719.878500    Male  2023-05-27
147          148  31.0  200000.000000  Female  2023-05-28
148          149  56.0       5.000000    Male  2023-05-29
149          150  44.0            NaN  Female  2023-05-30

[150 rows x 5 columns]

In [53]:
df.head()

   customer_id   age        income  gender signup_date
0            1  56.0  15703.823439    Male  2023-01-01
1            2  69.0  67328.537566  Female  2023-01-02
2            3  46.0  56305.706024    Male  2023-01-03
3            4  32.0  50514.889743    Male  2023-01-04
4            5  60.0  56376.411648  Female  2023-01-05

In [54]:
df.shape

(150, 5)

In [55]:
df.columns

Index(['customer_id', 'age', 'income', 'gender', 'signup_date'], dtype='object')

In [56]:
df.dtypes

customer_id      int64
age            float64
income         float64
gender          object
signup_date     object
dtype: object

In [57]:
df.describe()

       customer_id         age         income
count   150.000000  145.000000     149.000000
mean     75.500000   42.751724   56473.961113
std      43.445368   14.953879   19386.997557
min       1.000000   18.000000       5.000000
25%      38.250000   31.000000   44469.203592
50%      75.500000   42.000000   56456.163240
75%     112.750000   56.000000   63802.856407
max     150.000000   69.000000  200000.000000

* For interpreting with the rows and columns of our given dataframe
axis=1 -> interpreting with the rows of the dataframe
axis==0 -> interpreting with the columns of the dataframe

In [58]:
df.columns

Index(['customer_id', 'age', 'income', 'gender', 'signup_date'], dtype='object')

In [59]:
df.rename(columns={
    'customer_id' : 'Customer_ID',
    'age' : 'Age',
    'income' : 'Income',
    'gender' : 'Gender',
    'signup_date' : 'Signup_Date'
}, inplace=True)
# I just renamed the column of the given columns for myself that i easier for me to use into...

In [60]:
df.head()

   Customer_ID   Age        Income  Gender Signup_Date
0            1  56.0  15703.823439    Male  2023-01-01
1            2  69.0  67328.537566  Female  2023-01-02
2            3  46.0  56305.706024    Male  2023-01-03
3            4  32.0  50514.889743    Male  2023-01-04
4            5  60.0  56376.411648  Female  2023-01-05

In [61]:
df.isnull().sum()

Customer_ID    0
Age            5
Income         1
Gender         7
Signup_Date    0
dtype: int64

In [62]:
df[df['Age'].isnull()]
# This shows me all the missing ( NaN ) values of the age of the people from our dataframe...
# I will fill the ages of the missing peoople from our dataframe with the median of the ages of the dataframe

     Customer_ID  Age        Income  Gender Signup_Date
6              7  NaN  51704.921682    Male  2023-01-07
122          123  NaN  41742.138457    Male  2023-05-03
123          124  NaN  57305.876589     NaN  2023-05-04
133          134  NaN  62706.789264  Female  2023-05-14
134          135  NaN  62725.715295    Male  2023-05-15

In [63]:
# Filling the value of the age with the median

df['Age'].fillna(df['Age'].median(),inplace=True)
df

C:\Users\LEGION\AppData\Local\Temp\ipykernel_8900\943702579.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(),inplace=True)

     Customer_ID   Age         Income  Gender Signup_Date
0              1  56.0   15703.823439    Male  2023-01-01
1              2  69.0   67328.537566  Female  2023-01-02
2              3  46.0   56305.706024    Male  2023-01-03
3              4  32.0   50514.889743    Male  2023-01-04
4              5  60.0   56376.411648  Female  2023-01-05
..           ...   ...            ...     ...         ...
145          146  22.0   56228.112091    Male  2023-05-26
146          147  43.0   89719.878500    Male  2023-05-27
147          148  31.0  200000.000000  Female  2023-05-28
148          149  56.0       5.000000    Male  2023-05-29
149          150  44.0            NaN  Female  2023-05-30

[150 rows x 5 columns]

In [64]:
df[df['Age'].isnull()]

# This shows that the person with none/NaN age doesnnot exit in our dataframe

Empty DataFrame
Columns: [Customer_ID, Age, Income, Gender, Signup_Date]
Index: []

In [65]:
df['Age'].tail(10)

140    54.0
141    64.0
142    31.0
143    20.0
144    18.0
145    22.0
146    43.0
147    31.0
148    56.0
149    44.0
Name: Age, dtype: float64

In [66]:
df['Age'].dtypes
# Age cannot be a floating value hence we change the dtype of age to int

dtype('float64')

In [67]:
df['Age'] = df['Age'].astype(int)

In [68]:
df['Age'].dtypes

dtype('int64')

In [69]:
df['Age'].isnull().sum()

np.int64(0)

In [70]:
df.shape

(150, 5)

In [71]:
# For the next column we have -> income column
df['Income'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 150 entries, 0 to 149
Series name: Income
Non-Null Count  Dtype
--------------  -----
149 non-null    float64
dtypes: float64(1)
memory usage: 1.3 KB

In [72]:
df['Income'].isnull().sum()

np.int64(1)

In [73]:
# Printing or displaying the row of the null value of the income column

df[df['Income'].isnull()]

     Customer_ID  Age  Income  Gender Signup_Date
149          150   44     NaN  Female  2023-05-30

In [74]:
df[df['Income'].isnull()]

     Customer_ID  Age  Income  Gender Signup_Date
149          150   44     NaN  Female  2023-05-30

In [75]:
df['Income'].isnull().sum()

np.int64(1)

In [76]:
df = df.dropna(subset=['Income'])

In [77]:
df['Income'].isnull().sum()

np.int64(0)

In [78]:
df['Income'].info()

<class 'pandas.core.series.Series'>
Index: 149 entries, 0 to 148
Series name: Income
Non-Null Count  Dtype
--------------  -----
149 non-null    float64
dtypes: float64(1)
memory usage: 2.3 KB

In [79]:
df.isnull().sum()

Customer_ID    0
Age            0
Income         0
Gender         7
Signup_Date    0
dtype: int64

In [80]:
# Still the gender got some of the remaining missing values, hence we clear them out 
df['Gender'].isnull().sum()
# This shows that there are still 7 NaN/None values for the column gender

np.int64(7)

In [81]:
df[df['Gender'].isnull()]

     Customer_ID  Age        Income Gender Signup_Date
17            18   39  69529.674858    NaN  2023-01-18
25            26   50  51481.192999    NaN  2023-01-26
36            37   64  26218.431771    NaN  2023-02-06
78            79   27  44799.629176    NaN  2023-03-20
102          103   42  55195.028378    NaN  2023-04-13
123          124   42  57305.876589    NaN  2023-05-04
124          125   25  55873.130777    NaN  2023-05-05

* For the handling of the missing null values of the gender, we can calculate by the average income of the male or female with the remaining and add its average *

In [82]:
df = df.dropna(subset=['Gender'])

In [83]:
df['Gender'].isnull().sum()

np.int64(0)

In [84]:
df.isnull().sum()

Customer_ID    0
Age            0
Income         0
Gender         0
Signup_Date    0
dtype: int64

In [85]:
df.head()

   Customer_ID  Age        Income  Gender Signup_Date
0            1   56  15703.823439    Male  2023-01-01
1            2   69  67328.537566  Female  2023-01-02
2            3   46  56305.706024    Male  2023-01-03
3            4   32  50514.889743    Male  2023-01-04
4            5   60  56376.411648  Female  2023-01-05

In [87]:
df.head()

   Customer_ID  Age        Income  Gender Signup_Date
0            1   56  15703.823439    Male  2023-01-01
1            2   69  67328.537566  Female  2023-01-02
2            3   46  56305.706024    Male  2023-01-03
3            4   32  50514.889743    Male  2023-01-04
4            5   60  56376.411648  Female  2023-01-05

In [88]:
df['Income'] = df['Income'].astype(int)

In [94]:
df.rename(columns={
    'Income' : 'Income( In Rupees )'
}, inplace=True)

In [96]:
df['Signup_Date'].dtypes

dtype('O')

In [99]:
# Changing the singup date -> to a standard dame time in our dataframe

df['Signup_Date'] = pd.to_datetime(df['Signup_Date'])

In [ ]:
df['Signup_Date'].dtypes

dtype('<M8[ns]')

In [101]:
df.head()

   Customer_ID  Age  Income( In Rupees )  Gender Signup_Date
0            1   56                15703    Male  2023-01-01
1            2   69                67328  Female  2023-01-02
2            3   46                56305    Male  2023-01-03
3            4   32                50514    Male  2023-01-04
4            5   60                56376  Female  2023-01-05